jpnorair/OpenTag/include/platform/hw/STM32WLxx_config.h
/* Copyright 2009-2014 JP Norair
  *
  * Licensed under the OpenTag License, Version 1.0 (the "License");
  * you may not use this file except in compliance with the License.
  * You may obtain a copy of the License at
  *
  * http://www.indigresso.com/wiki/doku.php?id=opentag:license_1_0
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  */
/**
  * @file       /include/platform/hw/STM32WLxx_config.h
  * @author     JP Norair
  * @version    R100
  * @date       20 Dec 2021
  * @brief      Platform Library Macros and Functions for STM32WL
  * @ingroup    Platform
  *
  ******************************************************************************
  */
  

#ifndef __PLATFORM_STM32WLxx_CONFIG_H
#define __PLATFORM_STM32WLxx_CONFIG_H

#include <otstd.h>

//Stored in App Code folder
#include <app/board_config.h>


#include <app/isr_config_STM32WL55.h>


/** Long Chip-Select Section <BR>
  * ========================================================================<BR>
  * In your project gcc defines or in the board config file you should set the
  * part number for the MCU on the board.  The preprocessing below will set up
  * other attributes based on the part number.
  */

#define __STM32__
#define __STM32WL__
#define __STM32WLxx__

#define STM32
#define STM32WL
#define STM32WLxx


// 48 Pin STM32WLs are in UFQFPN48 packages
// Port A: { 0:15 } 
// Port B: { 0:7 } 
// Port C: { 14, 15 }
#if (   defined(__STM32WLE5C8__) \
    ||  defined(__STM32WLE5CB__) \
    ||  defined(__STM32WLE5CC__) \
    ||  defined(__STM32WL55C8__) \
    ||  defined(__STM32WL55CB__) \
    ||  defined(__STM32WL55CC__) \
    )
    
#   define __STM32WLxxCx__
#   define STM32WLxxCx
#   define MCU_PARAM_PORTS  3

#   if (   defined(__STM32WLE5CC__) \
       ||  defined(__STM32WL55CC__) \
       )
#       define FLASH_SIZE       (256*1024)
#       define SRAM_SIZE        (64*1024)    
#       define EEPROM_SIZE      (0*1024)
#       define __STM32WLxxCC__
#       define STM32WLxxCC

#   elif ( defined(__STM32WLE5CB__) \
       ||  defined(__STM32WL55CB__) \
       )
#       define FLASH_SIZE       (128*1024)
#       define SRAM_SIZE        (48*1024)    
#       define EEPROM_SIZE      (0*1024)
#       define __STM32WLxxCB__
#       define STM32WLxxCB

#   else
#       define FLASH_SIZE       (64*1024)
#       define SRAM_SIZE        (20*1024)    
#       define EEPROM_SIZE      (0*1024)
#       define __STM32WLxxC8__
#       define STM32WLxxC8

#	endif

// 73 Pin BGA
#elif ( defined(__STM32WLE5J8__) \
    ||  defined(__STM32WLE5JB__) \
    ||  defined(__STM32WLE5JC__) \
    ||  defined(__STM32WL55J8__) \
    ||  defined(__STM32WL55JB__) \
    ||  defined(__STM32WL55JC__) \
    )
#   define __STM32WLxxJx__
#   define STM32WLxxJx
#   define MCU_PARAM_PORTS  3

#   if (   defined(__STM32WLE5JC__) \
       ||  defined(__STM32WL55JC__) \
       )
#       define FLASH_SIZE       (256*1024)
#       define SRAM_SIZE        (64*1024)    
#       define EEPROM_SIZE      (0*1024)
#       define __STM32WLxxJC__
#       define STM32WLxxJC

#   elif ( defined(__STM32WLE5JB__) \
       ||  defined(__STM32WL55JB__) \
       )
#       define FLASH_SIZE       (128*1024)
#       define SRAM_SIZE        (48*1024)    
#       define EEPROM_SIZE      (0*1024)
#       define __STM32WLxxJB__
#       define STM32WLxxJB

#   else
#       define FLASH_SIZE       (64*1024)
#       define SRAM_SIZE        (20*1024)    
#       define EEPROM_SIZE      (0*1024)
#       define __STM32WLxxJ8__
#       define STM32WLxxJ8

#	endif

// 59 Pin CSP
#elif ( defined(__STM32WLE5U8__) \
    ||  defined(__STM32WLE5UB__) \
    ||  defined(__STM32WLE5UC__) \
    ||  defined(__STM32WL55U8__) \
    ||  defined(__STM32WL55UB__) \
    ||  defined(__STM32WL55UC__) \
    )
#   define __STM32WLxxUx__
#   define STM32WLxxUx
#   define MCU_PARAM_PORTS  3

#   if (   defined(__STM32WLE5UC__) \
       ||  defined(__STM32WL55UC__) \
       )
#       define FLASH_SIZE       (256*1024)
#       define SRAM_SIZE        (64*1024)    
#       define EEPROM_SIZE      (0*1024)
#       define __STM32WLxxUC__
#       define STM32WLxxUC

#   elif ( defined(__STM32WLE5UB__) \
       ||  defined(__STM32WL55UB__) \
       )
#       define FLASH_SIZE       (128*1024)
#       define SRAM_SIZE        (48*1024)    
#       define EEPROM_SIZE      (0*1024)
#       define __STM32WLxxUB__
#       define STM32WLxxUB

#   else
#       define FLASH_SIZE       (64*1024)
#       define SRAM_SIZE        (20*1024)    
#       define EEPROM_SIZE      (0*1024)
#       define __STM32WLxxU8__
#       define STM32WLxxU8

#	endif

// Unknown Part, so use the lowest-common-denominator
#else
#   warning "Unknown STM32WL defined.  Defaulting to STM32WLxxC8"
#   define MCU_PARAM_PORTS  3
#   define FLASH_SIZE       (64*1024)
#   define SRAM_SIZE        (20*1024)    
#   define EEPROM_SIZE      (0*1024)
#   define __STM32WLxxCx__
#   define STM32WLxxCx
#   define __STM32WLxxC8__
#   define STM32WLxxC8

#endif






/** Back to regularly-sheduled program <BR>
  * ========================================================================<BR>
  */

// From lib/CMSIS/Device
#include <stm32wlxx.h>

// From lib/CMSIS/Include
#ifdef CORE_CM0PLUS
#   ifndef CORTEX_M0PLUS
#       define CORTEX_M0PLUS
#   endif
#   include <cm0plus_endian.h>
#   include <cm0plus_byteswap.h>
#   include <cm0plus_bitrotate.h>
//#   include <cm0plus_countleadingzeros.h>
#   include <cm0plus_saturation.h>
#else
#   ifndef CORTEX_M4
#       define CORTEX_M4
#   endif
#   include <cm4_endian.h>
#   include <cm4_byteswap.h>
#   include <cm4_bitrotate.h>
#   include <cm4_countleadingzeros.h>
#   include <cm4_saturation.h>
#endif

// Definitions removed from recent STM32 libs
#define GPIO_MODER_INPUT            ((uint32_t)0x00000000)
#define GPIO_MODER_OUTPUT           ((uint32_t)0x00000001)
#define GPIO_MODER_ALT              ((uint32_t)0x00000002)
#define GPIO_MODER_ANALOG           ((uint32_t)0x00000003)
#define GPIO_MODER_IN               ((uint32_t)0x00000000)
#define GPIO_MODER_OUT              ((uint32_t)0x00000001)
#define GPIO_MODER_ALT              ((uint32_t)0x00000002)
#define GPIO_MODER_AN               ((uint32_t)0x00000003)
#define GPIO_OTYPER_PUSHPULL        ((uint32_t)0x00000000)
#define GPIO_OTYPER_OPENDRAIN       ((uint32_t)0x00000001)
#define GPIO_OSPEEDR_400kHz         ((uint32_t)0x00000000)
#define GPIO_OSPEEDR_2MHz           ((uint32_t)0x00000001) 
#define GPIO_OSPEEDR_10MHz          ((uint32_t)0x00000002)
#define GPIO_OSPEEDR_40MHz          ((uint32_t)0x00000003)








/** Cryptographic Library Setup      <BR>
  * ========================================================================<BR>
  * Needed to build AES128 or other types of Crypto
  */

  
  

/** Special Platform functions for STM32WL      <BR>
  * ========================================================================<BR>
  * These must be defined before including platform_config.h, so that they
  * can be used for inline functions.
  */
void platform_ext_pllon();
void platform_ext_plloff();
void platform_ext_wakefromstop();
void platform_ext_hsitrim();
void platform_ext_msitrim();
ot_u16 platform_ext_lsihz();







