jpnorair/OpenTag/include/platform/hw/STM32WLxx_config.h
/** Platform Support settings      <BR>
  * ========================================================================<BR>
  * STM32 is little endian with 4 byte pointer (32 bits), and at this stage it
  * can be compiled using GCC (RIDE, most other IDE's) or IAR's proprietary
  * compiler.
  */

#define PLATFORM(VAL)           PLATFORM_##VAL
#define PLATFORM_STM32WLxx

#ifndef __LITTLE_ENDIAN__
#   error "Endian-ness misdefined, should be __LITTLE_ENDIAN__ (check build_config.h)"
#endif
#define PLATFORM_POINTER_SIZE           4               // How many bytes is a pointer?
#define PLATFORM_ENDIAN16(VAR16)        __REV16(VAR16)  // Big-endian to Platform-endian
#define PLATFORM_ENDIAN32(VAR32)        __REV(VAR32)    // Big-endian to Platform-endian
#define PLATFORM_ENDIAN16_C(CONST16)    (ot_u16)( (((ot_u16)CONST16) << 8) | (((ot_u16)CONST16) >> 8) )






/** STM32L family MCU settings     <BR>
  * ========================================================================<BR>
  * STM32L has a peculiar FLASH design where the erased value is 0 instead of
  * 1.  This requires some unusual setup for the Memory configuration.
  * 
  * @todo get Hardware CRC16 working.  Currently doesn't give correct calcs.
  */
#define MCU_FEATURE(VAL)        MCU_FEATURE_##VAL   // FEATURE                  NOTE
#define MCU_FEATURE_SVMONITOR   ENABLED             // Auto Low V powerdown     On many MCUs
#define MCU_FEATURE_CRC16       DISABLED            // CRC16                    Exists, but needs to be tested
#define MCU_FEATURE_CRC         MCU_FEATURE_CRC16   // Legacy definition
#define MCU_FEATURE_ECC         DISABLED            // ECC engine               Exists, but needs to be tested

// True Random Number HW
#define MCU_FEATURE_TRNG        ENABLED
// AES HW
#define MCU_FEATURE_AES128      ENABLED

#define MCU_TYPE(VAL)                   MCU_TYPE_##VAL
#define MCU_TYPE_PTRINT                 ot_s32
#define MCU_TYPE_PTRUINT                ot_u32

#define MCU_PARAM(VAL)                  MCU_PARAM_##VAL
#define MCU_PARAM_POINTERSIZE           4
#define MCU_PARAM_ERRPTR                ((ot_s32)-1)
#define MCU_PARAM_UART_9600BPS          9600
#define MCU_PARAM_UART_28800BPS         28800
#define MCU_PARAM_UART_57600BPS         57600
#define MCU_PARAM_UART_115200BPS        115200
#define MCU_PARAM_UART_250000BPS        250000
#define MCU_PARAM_UART_500000BPS        500000


/** LPTIM Manipulations      <BR>
  * ========================================================================<BR>
  * Tasking waits longer than this (in ticks) will loop through the scheduler.
  * It is pretty rare with OpenTag for waits to be longer than 2 seconds
  * (2048 ticks), so this boundary rarely occurs.
  *
  * The LPTIM used for STM32WL is oversampled beyond 1024 Hz (8192 Hz) in
  * order to workaround the 4-clock update lag of the LPTIM Compare Register.
  */
#define MCU_PARAM_LPTIM_OVERSAMPLE		3
#define MCU_PARAM_LPTIM_SHIFT			0
#define MCU_PARAM_LPTIM_PS_SHIFT        (MCU_PARAM_LPTIM_OVERSAMPLE+MCU_PARAM_LPTIM_SHIFT)
#define MCU_PARAM_LPTIM_LIMIT           ((65536 >> MCU_PARAM_LPTIM_PS_SHIFT) - 260)




#define SRAM_START_ADDR         0x20000000
#define SRAM2_START_ADDR        0x10000000
#define FLASH_START_ADDR        0x08000000
#define FLASH_START_PAGE        0
#define FLASH_PAGE_SIZE         2048
#define FLASH_WORD_BYTES        8
#define FLASH_WORD_BITS         (FLASH_WORD_BYTES*8)
#define FLASH_PAGE_ADDR(VAL)    (FLASH_START_ADDR + ( (VAL) * FLASH_PAGE_SIZE) )

// STM32L has peculiar flash, where 0 is the erase value.  
// On every other flash, it is 1 (i.e. FFFF).
//#define NULL_vaddr              0x0000




/** Chip Settings  <BR>
  * ========================================================================<BR>
  * @todo Check if this is even needed.  ARMGCC is dominant compiler
  */



/** Data section Nomenclature  <BR>
  * ========================================================================<BR>
  * @todo Check if this is even needed.  ARMGCC is dominant compiler
  */




/** Interrupt Nomenclature  <BR>
  * ========================================================================<BR>
  * Use the "platform_isr_...()" functions in the code.  These get wrapped into
  * the official ISR function, which is defined to STM32L.  The wrapper allows
  * low power system calls (sleeping calls) to be abstracted from the user.
  *
  * For STM32L, the interrupts are defined in a startup assembly file, from:
  * /lib/CMSIS/Device/STM32L0xx/startup/...
  * They each have special names that are defined in this file.
  *
  * The board support header should define __ISR_... constants for ISRs that 
  * are suitable for the board.  The Application may define or negate ISRs as
  * it needs, also, in its isr_config_XXX.h file.
  *
  * These functions are implemented in the platform module, driver modules, or
  * in the application.
  */

#if !defined(OT_PARAM_SYSTHREADS)
#   define OT_PARAM_SYSTHREADS      0
#endif
#if !defined(OT_PARAM_SSTACK_ALLOC)
#   define OT_PARAM_SSTACK_ALLOC    (512)
#elif (OT_PARAM_SSTACK_ALLOC & 3)
#   error "OT_PARAM_SSTACK_ALLOC must be 32-bit aligned."
#endif

#if (OT_PARAM_SYSTHREADS != 0)
#   if !defined(OT_PARAM_TSTACK_ALLOC)
#       define OT_PARAM_TSTACK_ALLOC    (OT_PARAM_SYSTHREADS*160)
#   endif
#   if ((OT_PARAM_TSTACK_ALLOC/OT_PARAM_SYSTHREADS) < 80)
#       error "Specified Thread Stack Size allocates less than 80 bytes per thread stack."
#   endif
#   if (OT_PARAM_TSTACK_ALLOC & 3)
#       error "OT_PARAM_TSTACK_ALLOC must be 32-bit aligned."
#   endif
#endif


#ifdef CORE_CM0PLUS

#ifndef __CM0_NVIC_GROUPS
#   define __CM0_NVIC_GROUPS    4
#endif

#   ifndef __KERNEL_HICCULP__
#       define __KERNEL_HICCULP__
#   endif
#   define PLATFORM_NVIC_KERNEL_GROUP   b00
#   define PLATFORM_NVIC_RF_GROUP       b01
#   define PLATFORM_NVIC_IO_GROUP       b01
#   define PLATFORM_NVIC_INT_GROUP      b10
#   define PLATFORM_NVIC_TASK_GROUP     b11

///@todo these platform_isr...() functions are from STM32L4

/// These platform_isr_... functions are called from core_isr.c, from within
/// the primary ISRs.  They can be used in your application freely.  All entry 
/// and exit hooks that OpenTag may need to put around your ISR code are 
/// managed in core_isr.c and you, the app developer, do not need to worry 
/// about those unless you are hacking the kernel.
/// 
/// @note Some of the STM32WL interrupts are abstracted from Hardware into 
/// "synthetic" interrupts.  We do this to simplify app development, since some
/// of the hardware interrupts are grouped together inconveniently.

// Trust Zone Illegal Access has its own IRQ
void platform_isr_tz(void);

// PVD/PVM has a shared IRQ, but only a single ISR as well
void platform_isr_pvdpvm(void);

// RTC, Tamper, and LSE-Clock-Security have a shared IRQ
void platform_isr_rtcalarm(void);
void platform_isr_rtcwakeup(void);
void platform_isr_rtcssru(void);
void platform_isr_tamper(void);
void platform_isr_timestamp(void);
void platform_isr_lsecss(void);

// CPU1-SEV, Flash, and RCC have a shared IRQ
void platform_isr_c1sev(void);
void platform_isr_flash(void);
void platform_isr_rcc(void);

// EXTI0-1 have a shared IRQ
void platform_isr_exti0(void);
void platform_isr_exti1(void);

// EXTI2-3 have a shared IRQ
void platform_isr_exti2(void);
void platform_isr_exti3(void);

// EXTI4-15 have a shared IRQ
void platform_isr_exti4(void);
void platform_isr_exti5(void);
void platform_isr_exti6(void);
void platform_isr_exti7(void);
void platform_isr_exti8(void);
void platform_isr_exti9(void);
void platform_isr_exti10(void);
void platform_isr_exti11(void);
void platform_isr_exti12(void);
void platform_isr_exti13(void);
void platform_isr_exti14(void);
void platform_isr_exti15(void);

// COMP1, COMP2, ADC, and DAC have a shared IRQ
void platform_isr_comp1(void);
void platform_isr_comp2(void);
void platform_isr_adc(void);
void platform_isr_dac(void);

// DMA1 channels have a shared IRQ
void platform_isr_dma1ch1(void);
void platform_isr_dma1ch2(void);
void platform_isr_dma1ch3(void);
void platform_isr_dma1ch4(void);
void platform_isr_dma1ch5(void);
void platform_isr_dma1ch6(void);
void platform_isr_dma1ch7(void);

// DMA2 channels and DMAMUX have a shared IRQ
void platform_isr_dma2ch1(void);
void platform_isr_dma2ch2(void);
void platform_isr_dma2ch3(void);
void platform_isr_dma2ch4(void);
void platform_isr_dma2ch5(void);
void platform_isr_dma2ch6(void);
void platform_isr_dma2ch7(void);
void platform_isr_dmamux_ovr0(void);
void platform_isr_dmamux_ovr1(void);
void platform_isr_dmamux_ovr2(void);
void platform_isr_dmamux_ovr3(void);

