jpnorair/OpenTag/include/platform/hw/STM32WLxx_config.h
// LPTIM1 has its own IRQ
void platform_isr_lptim1(void);

// LPTIM2 has its own IRQ
void platform_isr_lptim2(void);

// LPTIM3 has its own IRQ
void platform_isr_lptim3(void);

// TIM1 has its own IRQ
void platform_isr_tim1(void);

// TIM2 has its own IRQ
void platform_isr_tim2(void);

// TIM16 has its own IRQ
void platform_isr_tim16(void);

// TIM17 has its own IRQ
void platform_isr_tim17(void);

// IPCC has its own IRQ
void platform_isr_ipcc(void);

// HSEM has its own IRQ
void platform_isr_hsem(void);

// RNG has its own IRQ
void platform_isr_rng(void);

// AES & PKA have a shared IRQ
void platform_isr_aes(void);
void platform_isr_pka(void);

// I2C1 has its own IRQ
void platform_isr_i2c1(void);

// I2C2 has its own IRQ
void platform_isr_i2c2(void);

// I2C3 has its own IRQ
void platform_isr_i2c3(void);

// SPI1 has its own IRQ
void platform_isr_spi1(void);

// SPI2 has its own IRQ
void platform_isr_spi2(void);

// UART1 has its own IRQ
void platform_isr_usart1(void);

// UART2 has its own IRQ
void platform_isr_usart2(void);

// UART3 has its own IRQ
void platform_isr_lpuart1(void);

/// SPI to the Radio has its own IRQ
void platform_isr_rfspi(void);

/// Radio-Specific signals have a shared IRQ
void platform_isr_rfirq(void);
void platform_isr_rfbusy(void);


#else

#ifndef __CM4_NVIC_GROUPS
#   define __CM4_NVIC_GROUPS    2
#endif

#if (__CM4_NVIC_GROUPS == 1)
#   error "__CM4_NVIC_GROUPS is set to 1, but GULP Kernel not supported on this device yet."
//#   ifndef __KERNEL_GULP__
//#       define __KERNEL_GULP__
//#   endif
//#   define PLATFORM_NVIC_KERNEL_GROUP   0
//#   define PLATFORM_NVIC_RF_GROUP       0
//#   define PLATFORM_NVIC_IO_GROUP       0
//#   define PLATFORM_NVIC_TASK_GROUP     0

#elif (__CM4_NVIC_GROUPS == 2)
#   ifndef __KERNEL_HICCULP__
#       define __KERNEL_HICCULP__
#   endif
#   define PLATFORM_NVIC_KERNEL_GROUP   b0000
#   define PLATFORM_NVIC_RF_GROUP       b0100
#   define PLATFORM_NVIC_IO_GROUP       b1000
#   define PLATFORM_NVIC_INT_GROUP      b1000
#   define PLATFORM_NVIC_TASK_GROUP     b1000 

#elif (__CM4_NVIC_GROUPS == 4)
#   ifndef __KERNEL_HICCULP__
#       define __KERNEL_HICCULP__
#   endif
#   define PLATFORM_NVIC_KERNEL_GROUP   b0000
#   define PLATFORM_NVIC_RF_GROUP       b0100
#   define PLATFORM_NVIC_IO_GROUP       b0100
#   define PLATFORM_NVIC_INT_GROUP      b1000
#   define PLATFORM_NVIC_TASK_GROUP     b1100

#elif (__CM4_NVIC_GROUPS == 8)
#   ifndef __KERNEL_HICCULP__
#       define __KERNEL_HICCULP__
#   endif
#   define PLATFORM_NVIC_KERNEL_GROUP   b0000
#   define PLATFORM_NVIC_RF_GROUP       b0010
#   define PLATFORM_NVIC_IO_GROUP       b0100
#   define PLATFORM_NVIC_SLOWIO_GROUP   b0110
#   define PLATFORM_NVIC_INT_GROUP      b1100
#   define PLATFORM_NVIC_TASK_GROUP     b1110

#else
#   error "__CM4_NVIC_GROUPS must be set to 1, 2, 4, or 8"
#endif


///@todo these platform_isr...() functions are from STM32L4

/// These platform_isr_... functions are called from core_isr.c, from within
/// the primary ISRs.  They can be used in your application freely.  All entry 
/// and exit hooks that OpenTag may need to put around your ISR code are 
/// managed in core_isr.c and you, the app developer, do not need to worry 
/// about those unless you are hacking the kernel.
/// 
/// @note Some of the STM32WL interrupts are abstracted from Hardware into 
/// "synthetic" interrupts.  We do this to simplify app development, since some
/// of the hardware interrupts are grouped together inconveniently.

void platform_isr_wwdg(void);
void platform_isr_pvdpvm(void);

// Synthetic ISRs for RTC_tamp_stamp/css_lse interrupt
void platform_isr_rtctamper(void);
void platform_isr_csslse(void);

void platform_isr_rtcwakeup(void);

void platform_isr_flash(void);

void platform_isr_rcc(void);

void platform_isr_exti0(void);
void platform_isr_exti1(void);
void platform_isr_exti2(void);
void platform_isr_exti3(void);
void platform_isr_exti4(void);

void platform_isr_dma1ch1(void);
void platform_isr_dma1ch2(void);
void platform_isr_dma1ch3(void);
void platform_isr_dma1ch4(void);
void platform_isr_dma1ch5(void);
void platform_isr_dma1ch6(void);
void platform_isr_dma1ch7(void);

// Synthetic ISRs, via ADC1_2
void platform_isr_adc1(void);
void platform_isr_adc2(void);

// CAN interrupts not available on L41, L42 devices
void platform_isr_can1tx(void);
void platform_isr_can1rx0(void);
void platform_isr_can1rx1(void);
void platform_isr_can1sce(void);

// Synthetic ISRs, via EXTI9_5
void platform_isr_exti5(void);
void platform_isr_exti6(void);
void platform_isr_exti7(void);
void platform_isr_exti8(void);
void platform_isr_exti9(void);

// Synthetic ISRs, via TIM1_BRK/TIM15 Interrupt
void platform_isr_tim1brk(void);
void platform_isr_tim15(void);

// Synthetic ISRs, via TIM1_UP/TIM16 Interrupt
void platform_isr_tim1up(void);
void platform_isr_tim16(void);

// Synthetic ISRs, via TIM1_TRG_COM Interrupt
void platform_isr_tim1trg(void);
void platform_isr_tim1com(void);

void platform_isr_tim1cc(void);

void platform_isr_tim2(void);
void platform_isr_tim3(void);       // Only on 45xxx, 46xxx

void platform_isr_i2c1ev(void);
void platform_isr_i2c1er(void);
void platform_isr_i2c2ev(void);     // Not on 432xx, 442xx
void platform_isr_i2c2er(void);     // Not on 432xx, 442xx
void platform_isr_i2c3ev(void);
void platform_isr_i2c3er(void);
void platform_isr_i2c4ev(void);     // Only on 45xxx, 46xxx
void platform_isr_i2c4er(void);     // Only on 45xxx, 46xxx

void platform_isr_spi1(void);
void platform_isr_spi2(void);       // Not on 432xx, 442xx
void platform_isr_spi3(void);

void platform_isr_usart1(void);
void platform_isr_usart2(void);
void platform_isr_usart3(void);     // Not on 432xx, 442xx
void platform_isr_usart4(void);     // Only on 45xxx, 46xxx

// Synthetic ISRs, via EXTI15_10
void platform_isr_exti10(void);
void platform_isr_exti11(void);
void platform_isr_exti12(void);
void platform_isr_exti13(void);
void platform_isr_exti14(void);
void platform_isr_exti15(void);

void platform_isr_rtcalarm(void);

void platform_isr_sdmmc(void);      // Not on 41xxx, 42xxx, 432xx, 442xx, 

// Synthetic ISRs, via TIM6_DACUNDER
void platform_isr_tim6(void);
void platform_isr_dacunder(void);

void platform_isr_tim7(void);       // Only on 43xxx, 44xxx

